#pragma once
#ifndef OPTIONS_H
#define OPTIONS_H

#include <stdio.h>
#include <getopt.h>
#include <string.h>
#include <stdlib.h>
#include <sys/stat.h>
#include <limits.h>
#include "../log/log.h"
#include "context.h"

/*! \addtogroup options
 *  Функции для парсинга аргументов командной строки
 *  @{
 */

/*!
 * \brief Выводит описание всех доступных опций для ввода в командную строку
 * \details Опции программы:
 * 1) -d - Запуск в фоновом режиме (запускается как демон)
 * 2) -с <config> - Запуск с указанием пути к конфигурационному файлу (запускается не в фоне)
 * 3) -d -c - Запуск с указанием пути к конфигурационному файлу (запускается как демон)
 * 4) никаких опций - Запуск не в фоновом режиме
 * 5) -h - Выводит меню с описанием всех опций
 */
void print_info();

/*!
 * \brief Разбирает аргументы командной строки
 * \param int argc - Количество аргументов командной строки
 * \param char **argv - Массив аргументов командной строки
 * \param struct cache_control *cc - Указатель на структуру cache_control для сохранения результата
 * \return Возвращает 0 в случае успеха, -1 в случае ошибки или -2 в случае вызова меню с описанием опций
 * \details Обрабатывает флаги -d, -c, -h. Если путь к конфигу не указан, использует путь по умолчанию config/cachecontrol.conf,
 * перед завершением проверяет корректность пути к конфигурационному файлу
 */
int parse_options(int argc, char **argv, struct cache_control *cc);

/*!
 * \brief Проверяет корректность пути к конфигурационному файлу
 * \param char *path - путь к конфигурационному файлу
 * \return Возвращает 0 в случае успеха или -1 в случае ошибки
 * \details Использует stat() для проверки существования пути
 */
int validate_path_config(char *path);

/*! @} */

#endif
